from math import*
a = float(input('Введить головний коеффіцієнт (a) як ціле або як десятковий дріб: '))
b = float(input('Введіть другий коеффіцієнт (b) як ціле або як десятковий дріб: '))
c = float(input('Введіть вільний член (c) як ціле або як десятковий дріб: '))
D = (b ** 2) - (4 * a * c)
if D < 0:
    print('Коренів немає!')
elif D == 0:
    x = -b / (2 * a)
    print('Один корінь =', x)
else:
    x1 = (-b + sqrt(D)) / (2 * a)
    x2 = (-b - sqrt(D)) / (2 * a)
    print('Перший корінь =', x1, 'Другий корінь =', x2)
